[
  {
  "id": 1,
    "name":"Jumanji",
    "url": "https://drive.google.com/file/d/1MWyJFaLgzmHFEU824GES5vtnM2V6zAdn/preview",
    "year": 1995,
    "comments":
      "When siblings Judy and Peter discover an enchanted board game that opens the door to a magical world, they unwittingly invite Alan -- an adult who's been trapped inside the game for 26 years -- into their living room. Alan's only hope for freedom is to finish the game, which proves risky as all three find themselves running from giant rhinoceroses, evil monkeys and other terrifying creatures."
  },
  {
"id": 2,
    "name": "Jumanji: Welcome to the Jungle",
    "url": "https://drive.google.com/file/d/1Epx50WnRIC18ZWWM66RYUiimn5qlrD-L/preview",
    "year": 2017,
    "comments":
      "The tables are turned as four teenagers are sucked into Jumanji's world - pitted against rhinos, black mambas and an endless variety of jungle traps and puzzles. To survive, they'll play as characters from the game."
  },
  {"id": 3,
    "name": "Jumanji: The Next Level",
    "url": "https://drive.google.com/file/d/1QUgbmtyVHVHzpED9oV7I7_QNg247CZ1y/preview",
    "year": 2019,
    "comments":
      "As the gang return to Jumanji to rescue one of their own, they discover that nothing is as they expect. The players will have to brave parts unknown and unexplored in order to escape the world’s most dangerous game."
  },

  {"id": 4,
    "name": "Morning Glory",
    "url": "https://drive.google.com/file/d/1WqvasxlKkCOxCkd6VialfxeuRhHaumei/preview",
    "year": 2010,
    "comments": "A young and devoted morning television producer is hired as an executive producer on a long-running morning show at a once-prominent but currently failing station in New York City. Eager to keep the show on air, she recruits a former news journalist and anchor who disapproves of co-hosting a show that does not deal with real news stories."
  },
  {"id": 5,
    "name": "The Proposal",
    "url": "https://drive.google.com/file/d/1SVXBiQYEa1ik7jw2CNSd83E9Paqaq-ON/preview",
    "year": 2009,
    "comments": "When she learns she's in danger of losing her visa status and being deported, overbearing book editor Margaret Tate forces her put-upon assistant, Andrew Paxton, to marry her."
  },

  {"id": 6,
    "name": "Love the Coopers",
    "url": "https://drive.google.com/file/d/1Yf5F7p5Q_WQiu7gK_xhM7oYtdBFTx9Gf/preview",
    "year": 2015,
    "comments": "When four generations of the Cooper clan come together for their annual Christmas Eve celebration, a series of unexpected visitors and unlikely events turn the night upside down, leading them all toward a surprising rediscovery of family bonds and the spirit of the holiday."
  },
  {"id": 7,
    "name": "Life As We Know It",
    "url": "https://drive.google.com/file/d/1CqC7sLQHO1AW9tWQuH6jomoixX4C85W3/preview",
    "year": 2010,
    "comments": "After a distastrous first date for caterer Holly and network sports director Messer, all they have is common is a dislike for each other and their love for their goddaughter Sophie. But when they suddenly become all Sophie has in this world, Holly and Messer must set their differences aside. Juggling careers and social calendars, they'll have to find common ground while living under the same roof."
  },
  {"id": 8,
    "name": "Enchanted",
    "url": "https://drive.google.com/file/d/1YPEUjoip8ilO_XmUMeQvsgzRRT1Ym5a8/preview",
    "year": 2007,
    "comments": "The beautiful princess Giselle is banished by an evil queen from her magical, musical animated land and finds herself in the gritty reality of the streets of modern-day Manhattan. Shocked by this strange new environment that doesn't operate on a 'happily ever after' basis, Giselle is now adrift in a chaotic world badly in need of enchantment. But when Giselle begins to fall in love with a charmingly flawed divorce lawyer who has come to her aid - even though she is already promised to a perfect fairy tale prince back home - she has to wonder: Can a storybook view of romance survive in the real world?"
  },
  {"id": 9,
    "name": "The Edge of Seventeen",
    "url": "https://drive.google.com/file/d/1YQGvVPDTLSlVfec6WOcbMUqIYyJEzZ5o/preview",
    "year": 2016,
    "comments": "Two high school girls are best friends until one dates the other's older brother, who is totally his sister's nemesis."
  },
  {"id": 10,
    "name": "The Space Between Us",
    "url": "https://drive.google.com/file/d/1X8XeFRGupfHElLaOJQlPwcoeY5Rg-5Fo/preview",
    "year": 2017,
    "comments": "A young man raised by scientists on Mars returns to Earth to find his father."
  },
  {"id": 11,
    "name": "Identity Thief",
    "url": "https://drive.google.com/file/d/1P9nf4hwBlm8-BJk0A5KoRu8gfDN5oDho/preview",
    "year": 2013,
    "comments":"When a mild-mannered businessman learns his identity has been stolen, he hits the road in an attempt to foil the thief -- a trip that puts him in the path of a deceptively harmless-looking woman."
  },
  {"id": 12,
    "name": "This Is 40",
    "url": "https://drive.google.com/file/d/1aioLjzyWX_VnY6tfo0SJxOpuudUsjxGO/preview",
    "year": 2012,
    "comments": "Pete and Debbie are both about to turn 40, their kids hate each other, both of their businesses are failing, they're on the verge of losing their house, and their relationship is threatening to fall apart."
  },
  {"id": 13,
    "name": "Race to Witch Mountain",
    "url": "https://drive.google.com/file/d/1xY9WIeTL4o4GiE4ezD-QbWXorcNg3Kk6/preview",
    "year": 2009,
    "comments":
      "A taxi driver gets more than he bargained for when he picks up two teen runaways. Not only does the pair possess supernatural powers, but they're also trying desperately to escape people who have made them their targets."
  },
  {"id": 14,
    "name": "At First Sight",
    "url": "https://drive.google.com/file/d/1vBAMjtP4GBL8xvPow5QBAJvW4n1ZASW1/preview",
    "year": 1999,
    "comments":
      "A blind man has an operation to regain his sight at the urging of his girlfriend and must deal with the changes to his life."
  },
  {"id": 15,
    "name": "Click",
    "url": "https://drive.google.com/file/d/1ZLlbmbOx4ilju8u11YX06PVFAKMFRbLq/preview",
    "year": 2006,
    "comments":
      "A married workaholic, Michael Newman doesn't have time for his wife and children, not if he's to impress his ungrateful boss and earn a well-deserved promotion. So when he meets Morty, a loopy sales clerk, he gets the answer to his prayers: a magical remote that allows him to bypass life;s little distractions with increasingly hysterical results."
  },
  {"id": 16,
    "name": "Divergent",
    "url": "https://drive.google.com/file/d/1sc-vzHMVJ4bLdHPi0GykuM6DmDjjDSS6/preview",
    "year": 2014,
    "comments":
      "In a world divided into factions based on personality types, Tris learns that she`s been classified as Divergent and won't fit in. When she discovers a plot to destroy Divergents, Tris and the mysterious Four must find out what makes Divergents dangerous before it;s too late."
  },
  {"id": 17,
    "name": "Legally Blonde",
    "url": "https://drive.google.com/file/d/15VT9-zdX8J8S43yrsbNzcwr_Uw8ZZz9s/preview",
    "year": 2001,
    "comments":
      "Elle Woods, a fashionable sorority queen, is dumped by her boyfriend. She decides to follow him to law school, but while there, she figures out that there is more to herself than just looks."
  },
  {"id": 18,
    "name": "Planet of the Apes",
    "url": "https://drive.google.com/file/d/1Zd0-recm3kuWXjDr0dPsGlYwhwvFBsjH/preview",
    "year": 2001,
    "comments":
      "After a spectacular crash-landing on an uncharted planet, brash astronaut Leo Davidson finds himself trapped in a savage world where talking apes dominate the human race. Desperate to find a way home, Leo must evade the invincible gorilla army led by Ruthless General Thade."
  },
  {"id": 19,
    "name": "The Rewrite",
    "url": "https://drive.google.com/file/d/1-Z9u4AO7Fh7bREQyMZag6oUA20YnNJAw/preview",
    "year": 2014,
    "comments":
      "An Oscar-winning writer in a slump leaves Hollywood to teach screenwriting at a college on the East Coast, where he falls for a single mom taking classes there."
  },
  {"id": 20,
    "name": "Insurgent",
    "url": "https://drive.google.com/file/d/1ewRWSmySoCPS0_ioii1LyHq_ozlp1UVD/preview",
    "year": 2015,
    "comments":
      "Beatrice Prior must confront her inner demons and continue her fight against a powerful alliance which threatens to tear her society apart."
  },
  {"id": 21,
    "name": "Christmas Inheritance",
    "url": "https://drive.google.com/file/d/14kJTemabE-tzVfm3Adp54WzDQGqZX3TF/preview",
    "year": 2017,
    "comments":
      "To inherit her fathers company, socialite Ellen must first visit his small hometown, where she learns the value of hard work and helping others."
  },
  {"id": 22,
    "name": "Date Night",
    "url": "https://drive.google.com/file/d/1ACVhxoUik0dzyadtnVfeyra_oa2ldjGR/preview",
    "year": 2010,
    "comments": "Phil and Claire Foster fear that their mild-mannered relationship may be falling into a stale rut. During their weekly date night, their dinner reservation leads to their being mistaken for a couple of thieves—and now a number of unsavoury characters want Phil and Claire killed."
  },
  {"id": 23,
    "name": "Journey 2: The Mysterious Island",
    "url": "https://drive.google.com/file/d/1_9xtdWsp7UzRyqDsQ8dJs-NVTfeBlNQz/preview",
    "year": 2012,
    "comments": "Sean Anderson partners with his mom's boyfriend on a mission to find his grandfather, who is thought to be missing on a mythical island."
  },
  {"id": 24,
    "name": "Marley & Me",
    "url": "https://drive.google.com/file/d/1rd1F8uCEe97luC1m5zXg-8oO4AkovQkl/preview",
    "year": 2008,
    "comments": "A newly married couple who, in the process of starting a family, learn many of life's important lessons from their trouble-loving retriever, Marley. Packed with plenty of laughs to lighten the load, the film explores the highs and lows of marriage, maturity and confronting one's own mortality, as seen through the lens of family life with a dog."
  },
  {"id": 25,
    "name": "The Healer",
    "url": "https://drive.google.com/file/d/1UUBCWx9uhoWdCIf5sCZwlvP4LAsygXI-/preview",
    "year": 2017,
    "comments": "The film follows a man with an unwanted gift for healing who meets a teenager with cancer who helps him to find himself."
  },
  {"id": 27,
    "name": "You Again",
    "url": "https://drive.google.com/file/d/1wO2tGLF1sVtCsxFIQ7qnp18de8qxAZBJ/preview",
    "year": 2010,
    "comments": "History -- make that high school -- may repeat itself when Marni learns that Joanna, the mean girl from her past, is set to be her sister-in-law. Before the wedding bells toll, Marni must show her brother that a tiger doesn't change its stripes. On Marni's side is her mother, while Joanna's backed by her wealthy aunt."
  },
  {"id": 28,
    "name": "The DUFF",
    "url": "https://drive.google.com/file/d/1XKfHKF6cZeIsIqX_i0Gd8zIB4u8Ke-gB/preview",
    "year": 2015,
    "comments": "Bianca's universe turns upside down when she learns that her high school refers to her as a ‘DUFF' (Designated Ugly Fat Friend). Hoping to erase that label, she enlists the help of a charming jock and her favorite teacher. Together they'll face the school's mean girl and remind everyone that we are all someone's DUFF… and that's totally fine."
  },
  {"id": 29,
    "name": "The Upside",
    "url": "https://drive.google.com/file/d/1IX1w8tEeK-mdybK0tJWj-U4--r-ZFkgP/preview",
    "year": 2019,
    "comments": "Phillip is a wealthy quadriplegic who needs a caretaker to help him with his day-to-day routine in his New York penthouse. He decides to hire Dell, a struggling parolee who's trying to reconnect with his ex and his young son. Despite coming from two different worlds, an unlikely friendship starts to blossom."
  },
  {"id": 30,
    "name": "13 Going on 30",
    "url": "https://drive.google.com/file/d/1Uo80ux74ReWwR2koTtRSnKZ0wzkCqUxh/preview",
    "year": 2004,
    "comments": "After total humiliation at her thirteenth birthday party, Jenna Rink wants to just hide until she's thirty. With a little magic, her wish is granted, but it turns out that being thirty isn't as always as awesome as she thought it would be!"
  },
  {"id": 31,
    "name": "Yes Day",
    "url": "https://drive.google.com/file/d/1cw3UdI6Q6Kt6qIqumlsQRPD7aSClZkvk/preview",
    "year": 2021,
    "comments": "A mom and dad who usually say no decide to say yes to their kids' wildest requests — with a few ground rules — on a whirlwind day of fun and adventure."
  },
  {"id": 32,
    "name": "The Butterfly Effect 2",
    "url": "https://drive.google.com/file/d/1YNZSagPnkfb7bzas2XLKUTnoHDASHrBD/preview",
    "year": 2006,
    "comments": "After his girlfriend, Julie, and two best friends are killed in a tragic auto accident, Nick struggles to cope with his loss and grief. Suffering from migraine-like seizures, Nick soon discovers that he has the power to change the past via his memories. However, his time-traveling attempts to alter the past and save his one true love have unexpected and dire consequences."
  },
  {"id": 33,
    "name": "I Love You, Man",
    "url": "https://drive.google.com/file/d/1gxd_SJlzNmp8A_hrHy-Gjo3rUKkFalv0/preview",
    "year": 2009,
    "comments": "Peter Klaven is a successful real estate agent who, upon getting engaged to the woman of his dreams, Zooey, discovers, to his dismay and chagrin, that he has no male friend close enough to serve as his Best Man. Peter immediately sets out to rectify the situation, embarking on a series of bizarre and awkward man-dates."
  },
  {"id": 34,
    "name": "Midnight in Paris",
    "url": "https://drive.google.com/file/d/1RrPfmUz2WjIvu85nuTb9i7Sw1R2zzHg3/preview",
    "year": 2011,
    "comments": "A romantic comedy about a family traveling to the French capital for business. The party includes a young engaged couple forced to confront the illusion that a life different from their own is better."
  },
  {"id": 35,
    "name": "Set It Up",
    "url": "https://drive.google.com/file/d/1aBrpqw-ysMMRdfL41EEaJUl4BxO8HcQ1/preview",
    "year": 2018,
    "comments": "Two overworked and underpaid assistants come up with a plan to get their bosses off their backs by setting them up with each other."
  },
  {"id": 36,
    "name": "A Thousand Words",
    "url": "https://drive.google.com/file/d/1R1SoycO4p-3KPa0BcsBWzYEiWWm-c5-4/preview",
    "year": 2012,
    "comments": "Jack McCall is a fast-talking literary agent, who can close any deal, any time, any way. He has set his sights on New Age guru Dr. Sinja for his own selfish purposes. But Dr. Sinja is on to him, and Jack’s life comes unglued after a magical Bodhi tree mysteriously appears in his backyard. With every word Jack speaks, a leaf falls from the tree and he realizes that when the last leaf falls, both he and the tree are toast. Words have never failed Jack McCall, but now he’s got to stop talking and conjure up some outrageous ways to communicate or he’s a goner."
  },
  {"id": 37,
    "name": "Source Code",
    "url": "https://drive.google.com/file/d/1nXVwvOAA6eJjFka_aya7YKhzZOiglbqB/preview",
    "year": 2011,
    "comments": "When decorated soldier Captain Colter Stevens wakes up in the body of an unknown man, he discovers he's part of a mission to find the bomber of a Chicago commuter train."
  },
  {"id": 38,
    "name": "Daddy's Home 2",
    "url": "https://drive.google.com/file/d/1JqXuXnR8-v0-SUeJMaqB8TqddFYQ6ltQ/preview",
    "year": 2017,
    "comments": "Brad and Dusty must deal with their intrusive fathers during the holidays."
  },
  {"id": 39,
    "name": "Back to the Future",
    "url": "https://drive.google.com/file/d/1j4X3eStKBPHm1qNQVNLUjk3aW7CMXpUc/preview",
    "year": 1985,
    "comments": "Eighties teenager Marty McFly is accidentally sent back in time to 1955, inadvertently disrupting his parents' first meeting and attracting his mother's romantic interest. Marty must repair the damage to history by rekindling his parents' romance and - with the help of his eccentric inventor friend Doc Brown - return to 1985."
  },
  {"id": 40,
    "name": "Due Date",
    "url": "https://drive.google.com/file/d/1JEclAYgCcChTRulk3kQBwdV4Nnh2pPyE/preview",
    "year": 2010,
    "comments": "Peter Highman must scramble across the US in five days to be present for the birth of his first child. He gets off to a bad start when his wallet and luggage are stolen, and put on the 'no-fly' list. Peter embarks on a terrifying journey when he accepts a ride from an actor."
  },
  {"id": 41,
    "name": "Everything, Everything",
    "url": "https://drive.google.com/file/d/1-01lxadgmgzCjk9Oo6GKVNuOfHXcEYe4/preview",
    "year": 2017,
    "comments": "A teenager who's lived a sheltered life because she's allergic to everything, falls for the boy who moves in next door."
  },
  {"id": 42,
    "name": "Valentine's Day",
    "url": "https://drive.google.com/file/d/1__L66hjbQlO9R_YyK50Z3fE5PehtSnCW/preview",
    "year": 2010,
    "comments": "More than a dozen Angelenos navigate Valentine's Day from early morning until midnight. Three couples awake together, but each relationship will sputter. A grade-school boy wants flowers for his first true love. Two high school seniors plan first-time sex at noon. A TV sports reporter gets the assignment to find romance in LA. A star quarterback contemplates his future. Two strangers meet on a plane. Grandparents, together for years, face a crisis. An 'I Hate Valentine's Day' dinner beckons the lonely and the lied to."
  },
  {"id": 43,
    "name": "Oblivion",
    "url": "https://drive.google.com/file/d/17Xx_o1IU3oSQCpQixxPL0qpHElSiMZMn/preview",
    "year": 2013,
    "comments": "Jack Harper is one of the last few drone repairmen stationed on Earth. Part of a massive operation to extract vital resources after decades of war with a terrifying threat known as the Scavs, Jack’s mission is nearly complete. His existence is brought crashing down when he rescues a beautiful stranger from a downed spacecraft. Her arrival triggers a chain of events that forces him to question everything he knows and puts the fate of humanity in his hands."
  },
  {"id": 44,
    "name": "Tooth Fairy",
    "url": "https://drive.google.com/file/d/1QoYtCJPNpeMBYWYeOx3my7dXVQFdoMIP/preview",
    "year": 2010,
    "comments": "When minor-league hockey player Derek Thompson -- who has a penchant for knocking out his opponents' teeth every time he plays -- disillusions a fan, he is sentenced to a stint for one week as a bona fide, tutu-clad, real-life tooth fairy. Soon, Derek is inspired to rekindle his youthful dreams."
  }
  
]
